https://machinelearningmastery.com/multivariate-time-series-forecasting-lstms-keras/  
https://www.justintodata.com/forecast-time-series-lstm-with-tensorflow-keras/

In [1]:
import pandas as pd
import warnings
import datetime
warnings.filterwarnings('ignore')

Vix index with data cut down to first of month only

In [2]:
vix_df = pd.read_csv('/home/jeremy/data/eco/^VIX.csv')

In [3]:
vix_df

,Date,Open,High,Low,Close,Adj Close,Volume
0,1990-01-02,17.240000,17.240000,17.240000,17.240000,17.240000,0
1,1990-01-03,18.190001,18.190001,18.190001,18.190001,18.190001,0
2,1990-01-04,19.219999,19.219999,19.219999,19.219999,19.219999,0
3,1990-01-05,20.110001,20.110001,20.110001,20.110001,20.110001,0
4,1990-01-08,20.260000,20.260000,20.260000,20.260000,20.260000,0
...,...,...,...,...,...,...,...
7730,2020-09-04,34.619999,38.279999,29.500000,30.750000,30.750000,0
7731,2020-09-08,30.610001,35.930000,30.520000,31.459999,31.459999,0
7732,2020-09-09,31.680000,31.780001,28.120001,28.809999,28.809999,0
7733,2020-09-10,28.670000,30.559999,27.590000,29.709999,29.709999,0
7734,2020-09-11,28.629999,29.730000,26.510000,26.870001,26.870001,0

In [4]:
def getFirstDayOfMonth(df):
    df = df[['Date','Close']]
    df['Date']=  pd.to_datetime(df['Date'], format='%Y-%m-%d')
    df = df.groupby(pd.Grouper(key='Date',freq="1M")).nth(0)
    df.reset_index(drop=True,inplace=True)
    df = df.sort_values('Date',ascending=True)
    df.reset_index(drop=True,inplace=True)
    return df

In [5]:
vix_df = getFirstDayOfMonth(vix_df)

In [6]:
vix_df.head()

        Date      Close
0 1990-01-02  17.240000
1 1990-02-01  24.870001
2 1990-03-01  21.900000
3 1990-04-02  22.840000
4 1990-05-01  18.430000

https://stackoverflow.com/questions/25797038/filter-data-to-get-only-first-day-of-the-month-rows

==================================================================================================================

CPI

In [7]:
cpi_df = pd.read_csv('/home/jeremy/data/eco/CPIAUCSL.csv')

In [44]:
cpi_df.tail()

          Date    Close
879 2020-04-01  255.902
880 2020-05-01  255.768
881 2020-06-01  257.214
882 2020-07-01  258.723
883 2020-08-01  259.681

In [9]:
cpi_df['Date']=  pd.to_datetime(cpi_df['DATE'], format='%Y-%m-%d')
cpi_df = cpi_df[['Date','CPIAUCSL']]
cpi_df.columns = ['Date','Close']
cpi_df=cpi_df.sort_values('Date',ascending=True)
cpi_df.reset_index(drop=True,inplace=True)

In [10]:
cpi_df.head()

        Date  Close
0 1947-01-01  21.48
1 1947-02-01  21.62
2 1947-03-01  22.00
3 1947-04-01  22.00
4 1947-05-01  21.95

===============================================================================================================

Dow Jones Transport

In [11]:
djt_df = pd.read_csv('/home/jeremy/data/eco/^DJT.csv')

In [12]:
djt_df = getFirstDayOfMonth(djt_df)

In [13]:
djt_df.head()

        Date        Close
0 1992-01-02  1342.099976
1 1992-02-03  1362.500000
2 1992-03-02  1443.000000
3 1992-04-01  1381.199951
4 1992-05-01  1359.500000

===============================================================================================================

2 yr note

In [14]:
twoyr_df = pd.read_csv('/home/jeremy/data/eco/DGS2.csv')

In [15]:
twoyr_df

            DATE   DGS2
0     1990-01-02  7.870
1     1990-01-03  7.940
2     1990-01-04  7.920
3     1990-01-05  7.900
4     1990-01-08  7.900
...          ...    ...
8018  2020-09-25   0.12
8019  2020-09-28   0.14
8020  2020-09-29   0.11
8021  2020-09-30   0.13
8022  2020-10-01   0.14

[8023 rows x 2 columns]

In [16]:
twoyr_df.columns = ['Date','Close']
twoyr_df = getFirstDayOfMonth(twoyr_df)

In [17]:
twoyr_df.head()

        Date  Close
0 1990-01-02  7.870
1 1990-02-01  8.280
2 1990-03-01  8.530
3 1990-04-02  8.620
4 1990-05-01  9.020

===============================================================================================================

10 yr note

In [18]:
tenyr_df = pd.read_csv('/home/jeremy/data/eco/DGS10.csv')
tenyr_df.columns = ['Date','Close']
tenyr_df = getFirstDayOfMonth(tenyr_df)

In [19]:
tenyr_df.head()

        Date Close
0 1990-01-02  7.94
1 1990-02-01  8.42
2 1990-03-01  8.59
3 1990-04-02  8.65
4 1990-05-01  9.08

===============================================================================================================

5 yr note

In [20]:
fiveyr_df = pd.read_csv('/home/jeremy/data/eco/^FVX.csv')
# fiveyr_df.columns = ['Date','Close']
fiveyr_df = getFirstDayOfMonth(fiveyr_df)

In [21]:
fiveyr_df.head()

        Date  Close
0 1962-01-02   3.88
1 1962-02-01   4.00
2 1962-03-01   3.71
3 1962-04-01    NaN
4 1962-05-01   3.63

===============================================================================================================

SP 500 PE Ratio

In [22]:
peRatio_df = pd.read_csv('/home/jeremy/data/eco/MULTPL-SP500_PE_RATIO_MONTH.csv')
peRatio_df.columns = ['Date','Close']
peRatio_df = getFirstDayOfMonth(peRatio_df)

In [23]:
peRatio_df.dtypes

Date     datetime64[ns]
Close           float64
dtype: object

In [24]:
peRatio_df.head()

        Date  Close
0 1871-01-01  11.10
1 1871-02-01  11.25
2 1871-03-01  11.52
3 1871-04-01  11.85
4 1871-05-01  12.15

===============================================================================================================

Unemployment Rate

In [25]:
urate_df = pd.read_csv('/home/jeremy/data/eco/UNRATE.csv')
urate_df.columns = ['Date','Close']
urate_df = getFirstDayOfMonth(urate_df)

In [26]:
 urate_df

          Date  Close
0   1948-01-01    3.4
1   1948-02-01    3.8
2   1948-03-01    4.0
3   1948-04-01    3.9
4   1948-05-01    3.5
..         ...    ...
867 2020-04-01   14.7
868 2020-05-01   13.3
869 2020-06-01   11.1
870 2020-07-01   10.2
871 2020-08-01    8.4

[872 rows x 2 columns]

===============================================================================================================

SP 500

In [27]:
sp_df = pd.read_csv('/home/jeremy/data/eco/^GSPC.csv')
sp_df = sp_df[['Date','Close']]

In [28]:
sp_df.head()

         Date      Close
0  1927-12-30  17.660000
1  1928-01-03  17.760000
2  1928-01-04  17.719999
3  1928-01-05  17.549999
4  1928-01-06  17.660000

In [29]:
sp_df[sp_df.Date == '1990-01-02']

             Date       Close
15550  1990-01-02  359.690002

In [30]:
sp_df.shape

(23285, 2)

In [31]:
sp_df = getFirstDayOfMonth(sp_df)

In [32]:
sp_df[sp_df.Date == '1990-01-02']

          Date       Close
745 1990-01-02  359.690002

In [33]:
sp_df.shape

(1114, 2)

In [40]:
dfs = ['Date','vix','cpi','djt','twoyr','tenyr','fiveyr','peRatio','urate','sp']

In [37]:
asof = pd.merge_asof(vix_df,cpi_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof,djt_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof,twoyr_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof,tenyr_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof,fiveyr_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof, peRatio_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof,urate_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))
asof = pd.merge_asof(asof,sp_df,on='Date',direction='nearest',tolerance=pd.Timedelta('5d'))

In [42]:
asof.columns = dfs

In [49]:
asof.dropna(inplace=True)

TypeError: dropna() got an unexpected keyword argument 'by'

In [53]:
asof.sort_values(by='Date',ascending=False, inplace=True)

In [54]:
asof

,Date,vix,cpi,djt,twoyr,tenyr,fiveyr,peRatio,urate,sp
366,2020-07-01,28.620001,258.723,9153.009766,0.17,0.69,0.313,27.57,10.2,3115.860107
365,2020-06-01,28.230000,257.214,8965.910156,0.14,0.66,0.302,26.69,11.1,3055.729980
364,2020-05-01,37.189999,255.768,8144.859863,0.20,0.64,0.369,25.10,13.3,2830.709961
363,2020-04-01,57.060001,255.902,7352.580078,0.23,0.62,0.369,23.74,14.7,2470.500000
360,2020-01-02,12.470000,258.820,10994.309570,.,.,1.671,24.88,3.6,3257.850098
...,...,...,...,...,...,...,...,...,...,...
32,1992-09-01,13.400000,141.100,1240.199951,4.120,6.56,5.520,23.20,7.6,416.070007
30,1992-07-01,13.340000,140.500,1341.369995,4.820,7.10,6.270,23.88,7.7,412.880005
29,1992-06-01,14.430000,140.100,1376.099976,5.290,7.39,6.690,23.95,7.8,417.299988
28,1992-05-01,16.610001,139.700,1359.500000,5.330,7.56,6.820,24.75,7.6,412.529999
27,1992-04-01,16.480000,139.400,1381.199951,5.530,7.46,6.820,24.73,7.4,404.230011